_posts/industry/2024-05-20-margo-technical-lexicon.html
---
layout: post
title: 边缘计算新标准 Margo：技术术语
tags: [industry]
categories: [industry]
---
<p>
Linux 基金会近日联合 ABB ，B&amp;R， Capgemini ，微软，罗克韦尔自动化，施耐德电气，以及西门子，发起了一个新的<a href="./2024-05-16-margo">开放标准项目 Margo</a>。目的是定义一套灵活、简单、易扩展的边缘接口标准。通过边缘编排软件，把边缘应用和边缘设备进行有效的管理起来。
</p>

<p>
之后，我介绍了 Margo <a href="./2024-05-19-margo-edge-device">对边缘计算设备的一些要求</a>。
</p>

<p>
今天再补充一下相关的基本概念。
</p>

<p>
<b>边缘应用（ Application ）</b>
</p>

<p>
边缘应用适配边缘计算设备的特定应用。边缘应用的组成部分包括：应用声明文件、应用描述文件、若干个容器。这些容器可以部署到若干个边缘计算节点上。
</p>

<p>
<b>边缘计算设备（Edge Compute Device）</b>
</p>

<p>
安装在用户现场、可运行 Margo 应用的边缘计算硬件设备。设备部署到现场后，根据其能力分成多个角色：
</p>
<ul class="org-ul">
<li>独立集群服务器</li>
<li>集群主节点</li>
<li>集群工作从节点</li>
<li>独立设备</li>
<li>嵌入式微设备</li>
</ul>

<p>
<b>工作负载编排软件（Workload Orchestration Software，简称 WOS）</b>
</p>

<p>
系统服务，帮助用户配置、部署、管理边缘应用。通过 Margo 标准接口与应用仓库、设备仓库通信，并编排边缘计算节点。
</p>

<p>
<b>工作负载编排代理（Workload Orchestration Agent）</b>
</p>

<p>
运行在边缘计算设备中的服务，用于和工作负载编排软件通信，接收工作负载和配置数据。
</p>

<p>
<b>设备编排软件（Device Orchestration Software）</b>
</p>

<p>
用于部署、删除、维护边缘计算设备。与工作负载编排软件一起，给用户提供边缘计算管理功能。
</p>

<p>
<b>设备编排代理（Device Orchestration Agent）</b>
</p>

<p>
运行在边缘计算设备中的服务，用于和设备编排软件通信，接收设备配置数据，并加载到边缘计算设备中。
</p>

<p>
<b>应用登记仓库（Application Registry）</b>
</p>

<p>
边缘应用开发人员搭建的资料仓库，存放应用声明和应用市场相关资料。
</p>

<p>
<b>应用仓库（Application Repository）</b>
</p>

<p>
编排软件从应用仓库获取应用资料，部署到边缘计算设备。
</p>

<p>
<b>应用市场（Application Marketplace）</b>
</p>

<p>
用户在应用市场，从应用厂商购买应用的使用权。
</p>
<ul class="org-ul">
<li>展示可购买的应用清单</li>
<li>用户可购买应用使用权限</li>
<li>提供应用相关信息，可以获取应用文件资料</li>
</ul>

<p>
<b>应用类目（Application Catalog）</b>
</p>

<p>
在工作负载编排软件中列出的可供用户部署和管理的应用清单。也就是从应用市场中购买了应用权限的应用。
</p>
